tutorials/lagrangian/simpleReactingParcelFoam/verticalChannel/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;

        tolerance        0;
        relTol           0.05;

        smoother         DICGaussSeidel;



        maxIter          50;
    };

    Phi
    {
        $p;
    }

    "(U|Yi|h|k|omega)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       0;
        relTol          0.1;
        maxIter         20;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 5;
}

SIMPLE
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    rhoMin          0.1;
    rhoMax          1.5;
}

relaxationFactors
{
    fields
    {
        p               0.3;
        rho             1;
    }
    equations
    {
        U               0.7;
        h               0.7;
        ".*"            0.7;
    }
}


// ************************************************************************* //
